src/cf/BusinessProcesses/Исполнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<BusinessProcess>
		<Properties>
			<Name>Исполнение</Name>
			<Task>Task.ЗадачиПользователей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/BusinessProcesses/Исполнение/Ext/ObjectModule.bsl
Процедура ПрохождениеПроверкиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РезультатПроверки;
КонецПроцедуры

Процедура ПроверкаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	РезультатПроверки = Задача.УспешноЗавершена;
	Комментарий = Задача.Комментарий;
КонецПроцедуры

Процедура ПроверкаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = Автор;
	ФормируемыеЗадачи[0].Автор = Автор;
	ФормируемыеЗадачи[0].Запрос = Комментарий;
КонецПроцедуры

Процедура ВыполнитьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = Исполнитель;
	ФормируемыеЗадачи[0].Автор = Автор;
	ФормируемыеЗадачи[0].Запрос = Комментарий;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ВыполнитьПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Комментарий = Задача.Комментарий;
КонецПроцедуры
